# FamilyParameter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter Class
Members See Also
---
The family parameter object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilyParameter : APIObject
```

Visual Basic
---
```text
Public Class FamilyParameter _
	Inherits APIObject
```

Visual C++
---
```text
public ref class FamilyParameter : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FamilyParameter
# See Also
FamilyParameter Members
Autodesk.Revit.DB Namespace